; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-4-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-6 - location
	p1-2 - location
	p1-4 - location
	p1-6 - location
	p1-8 - location
	p1-9 - location
	p2-5 - location
	p2-12 - location
	p4-2 - location
	p4-3 - location
	p5-2 - location
	p5-9 - location
	p5-10 - location
	p6-4 - location
	p6-12 - location
	p9-0 - location
	p10-1 - location
	p10-4 - location
	p10-7 - location
	p10-11 - location
	p11-5 - location
	p12-1 - location
	p12-3 - location
	p12-4 - location
	p12-8 - location
	)
	(:init
	(at driver1 s9)
	(at driver2 s0)
	(at driver3 s0)
	(at truck1 s7)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s7)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s9)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s10)
	(at package2 s4)
	(at package3 s11)
	(at package4 s1)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s1 p1-8)
	(path p1-8 s1)
	(path s8 p1-8)
	(path p1-8 s8)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-12)
	(path p2-12 s2)
	(path s12 p2-12)
	(path p2-12 s12)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s5 p5-9)
	(path p5-9 s5)
	(path s9 p5-9)
	(path p5-9 s9)
	(path s5 p5-10)
	(path p5-10 s5)
	(path s10 p5-10)
	(path p5-10 s10)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-12)
	(path p6-12 s6)
	(path s12 p6-12)
	(path p6-12 s12)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(path s10 p10-4)
	(path p10-4 s10)
	(path s4 p10-4)
	(path p10-4 s4)
	(path s10 p10-7)
	(path p10-7 s10)
	(path s7 p10-7)
	(path p10-7 s7)
	(path s10 p10-11)
	(path p10-11 s10)
	(path s11 p10-11)
	(path p10-11 s11)
	(path s11 p11-5)
	(path p11-5 s11)
	(path s5 p11-5)
	(path p11-5 s5)
	(path s12 p12-1)
	(path p12-1 s12)
	(path s1 p12-1)
	(path p12-1 s1)
	(path s12 p12-3)
	(path p12-3 s12)
	(path s3 p12-3)
	(path p12-3 s3)
	(path s12 p12-4)
	(path p12-4 s12)
	(path s4 p12-4)
	(path p12-4 s4)
	(path s12 p12-8)
	(path p12-8 s12)
	(path s8 p12-8)
	(path p12-8 s8)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 5)
	(= (time-to-drive s2 s1) 5)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 99)
	(= (time-to-drive s3 s1) 99)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 81)
	(= (time-to-drive s5 s1) 81)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 2)
	(= (time-to-drive s6 s1) 2)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 60)
	(= (time-to-drive s7 s1) 60)
	(link s1 s10)
	(link s10 s1)
	(= (time-to-drive s1 s10) 31)
	(= (time-to-drive s10 s1) 31)
	(link s1 s12)
	(link s12 s1)
	(= (time-to-drive s1 s12) 1)
	(= (time-to-drive s12 s1) 1)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 98)
	(= (time-to-drive s0 s2) 98)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 72)
	(= (time-to-drive s5 s2) 72)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 58)
	(= (time-to-drive s10 s2) 58)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 34)
	(= (time-to-drive s6 s3) 34)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 25)
	(= (time-to-drive s8 s3) 25)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 43)
	(= (time-to-drive s10 s3) 43)
	(link s3 s12)
	(link s12 s3)
	(= (time-to-drive s3 s12) 70)
	(= (time-to-drive s12 s3) 70)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 92)
	(= (time-to-drive s0 s4) 92)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 62)
	(= (time-to-drive s2 s4) 62)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 1)
	(= (time-to-drive s3 s4) 1)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 94)
	(= (time-to-drive s11 s4) 94)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 19)
	(= (time-to-drive s7 s5) 19)
	(link s5 s9)
	(link s9 s5)
	(= (time-to-drive s5 s9) 63)
	(= (time-to-drive s9 s5) 63)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 33)
	(= (time-to-drive s5 s6) 33)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 73)
	(= (time-to-drive s6 s7) 73)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 90)
	(= (time-to-drive s8 s7) 90)
	(link s7 s9)
	(link s9 s7)
	(= (time-to-drive s7 s9) 35)
	(= (time-to-drive s9 s7) 35)
	(link s7 s12)
	(link s12 s7)
	(= (time-to-drive s7 s12) 77)
	(= (time-to-drive s12 s7) 77)
	(link s8 s1)
	(link s1 s8)
	(= (time-to-drive s8 s1) 23)
	(= (time-to-drive s1 s8) 23)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 79)
	(= (time-to-drive s5 s8) 79)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 5)
	(= (time-to-drive s6 s8) 5)
	(link s9 s4)
	(link s4 s9)
	(= (time-to-drive s9 s4) 88)
	(= (time-to-drive s4 s9) 88)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 35)
	(= (time-to-drive s0 s10) 35)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 68)
	(= (time-to-drive s7 s10) 68)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 92)
	(= (time-to-drive s8 s10) 92)
	(link s11 s6)
	(link s6 s11)
	(= (time-to-drive s11 s6) 34)
	(= (time-to-drive s6 s11) 34)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 48)
	(= (time-to-drive s8 s11) 48)
	(link s11 s10)
	(link s10 s11)
	(= (time-to-drive s11 s10) 93)
	(= (time-to-drive s10 s11) 93)
	(link s12 s10)
	(link s10 s12)
	(= (time-to-drive s12 s10) 93)
	(= (time-to-drive s10 s12) 93)
	(= (fuel-used) 0)
)
	(:goal (and
	(at truck2 s5)
	(at truck3 s3)
	(at truck4 s0)
	(at package1 s7)
	(at package2 s0)
	(at package3 s7)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (board-truck driver1 truck3 s9)
   deleted: (at driver1 s9) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 0 of 6
2. (drive-truck truck3 s9 s7 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s7)
   changed: (fuel-used) from 0 to 350
   goals met: 0 of 6
3. (drive-truck truck3 s7 s10 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s10)
   changed: (fuel-used) from 350 to 1030
   goals met: 0 of 6
4. (load-truck package1 truck3 s10)
   deleted: (at package1 s10)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 0 of 6
5. (drive-truck truck3 s10 s7 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s7)
   changed: (fuel-used) from 1030 to 1778
   goals met: 0 of 6
6. (unload-truck package1 truck3 s7)
   deleted: (in package1 truck3)
   added: (at package1 s7)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 1 of 6
7. (drive-truck truck3 s7 s1 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s1)
   changed: (fuel-used) from 1778 to 2378
   goals met: 1 of 6
8. (disembark-truck driver1 truck3 s1)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 1 of 6
9. (board-truck driver1 truck4 s1)
   deleted: (at driver1 s1) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 1 of 6
10. (drive-truck truck4 s1 s10 driver1)
   deleted: (at truck4 s1)
   added: (at truck4 s10)
   changed: (fuel-used) from 2378 to 2688
   goals met: 1 of 6
11. (drive-truck truck4 s10 s11 driver1)
   deleted: (at truck4 s10)
   added: (at truck4 s11)
   changed: (fuel-used) from 2688 to 3618
   goals met: 1 of 6
12. (load-truck package3 truck4 s11)
   deleted: (at package3 s11)
   added: (in package3 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 1 of 6
13. (drive-truck truck4 s11 s10 driver1)
   deleted: (at truck4 s11)
   added: (at truck4 s10)
   changed: (fuel-used) from 3618 to 4641
   goals met: 1 of 6
14. (drive-truck truck4 s10 s7 driver1)
   deleted: (at truck4 s10)
   added: (at truck4 s7)
   changed: (fuel-used) from 4641 to 5389
   goals met: 1 of 6
15. (unload-truck package3 truck4 s7)
   deleted: (in package3 truck4)
   added: (at package3 s7)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 2 of 6
16. (drive-truck truck4 s7 s9 driver1)
   deleted: (at truck4 s7)
   added: (at truck4 s9)
   changed: (fuel-used) from 5389 to 5739
   goals met: 2 of 6
17. (drive-truck truck4 s9 s4 driver1)
   deleted: (at truck4 s9)
   added: (at truck4 s4)
   changed: (fuel-used) from 5739 to 6619
   goals met: 2 of 6
18. (load-truck package2 truck4 s4)
   deleted: (at package2 s4)
   added: (in package2 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 2 of 6
19. (drive-truck truck4 s4 s0 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (fuel-used) from 6619 to 7631
   goals met: 3 of 6
20. (disembark-truck driver1 truck4 s0)
   deleted: (driving driver1 truck4)
   added: (at driver1 s0) (empty truck4)
   goals met: 3 of 6
21. (unload-truck package2 truck4 s0)
   deleted: (in package2 truck4)
   added: (at package2 s0)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 4 of 6
22. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 4 of 6
23. (drive-truck truck4 s0 s2 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   changed: (fuel-used) from 7631 to 8611
   goals met: 3 of 6
24. (disembark-truck driver2 truck4 s2)
   deleted: (driving driver2 truck4)
   added: (at driver2 s2) (empty truck4)
   goals met: 3 of 6
25. (walk driver2 s2 p1-2)
   deleted: (at driver2 s2)
   added: (at driver2 p1-2)
   goals met: 3 of 6
26. (walk driver2 p1-2 s1)
   deleted: (at driver2 p1-2)
   added: (at driver2 s1)
   goals met: 3 of 6
27. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 3 of 6
28. (drive-truck truck3 s1 s2 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 8611 to 8661
   goals met: 3 of 6
29. (drive-truck truck3 s2 s0 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 8661 to 9641
   goals met: 3 of 6
30. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 3 of 6
31. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 6
32. (drive-truck truck3 s0 s10 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s10)
   changed: (fuel-used) from 9641 to 9991
   goals met: 3 of 6
33. (drive-truck truck3 s10 s7 driver3)
   deleted: (at truck3 s10)
   added: (at truck3 s7)
   changed: (fuel-used) from 9991 to 10671
   goals met: 3 of 6
34. (disembark-truck driver3 truck3 s7)
   deleted: (driving driver3 truck3)
   added: (at driver3 s7) (empty truck3)
   goals met: 3 of 6
35. (walk driver1 s0 p0-6)
   deleted: (at driver1 s0)
   added: (at driver1 p0-6)
   goals met: 3 of 6
36. (board-truck driver3 truck3 s7)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 6
37. (walk driver1 p0-6 s6)
   deleted: (at driver1 p0-6)
   added: (at driver1 s6)
   goals met: 3 of 6
38. (drive-truck truck3 s7 s1 driver3)
   deleted: (at truck3 s7)
   added: (at truck3 s1)
   changed: (fuel-used) from 10671 to 11271
   goals met: 3 of 6
39. (drive-truck truck3 s1 s2 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   changed: (fuel-used) from 11271 to 11321
   goals met: 3 of 6
40. (drive-truck truck3 s2 s4 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   changed: (fuel-used) from 11321 to 11941
   goals met: 3 of 6
41. (disembark-truck driver3 truck3 s4)
   deleted: (driving driver3 truck3)
   added: (at driver3 s4) (empty truck3)
   goals met: 3 of 6
42. (walk driver3 s4 p4-2)
   deleted: (at driver3 s4)
   added: (at driver3 p4-2)
   goals met: 3 of 6
43. (walk driver3 p4-2 s2)
   deleted: (at driver3 p4-2)
   added: (at driver3 s2)
   goals met: 3 of 6
44. (board-truck driver3 truck4 s2)
   deleted: (at driver3 s2) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 3 of 6
45. (drive-truck truck4 s2 s10 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s10)
   changed: (fuel-used) from 11941 to 12521
   goals met: 3 of 6
46. (walk driver1 s6 p6-4)
   deleted: (at driver1 s6)
   added: (at driver1 p6-4)
   goals met: 3 of 6
47. (drive-truck truck4 s10 s0 driver3)
   deleted: (at truck4 s10)
   added: (at truck4 s0)
   changed: (fuel-used) from 12521 to 12871
   goals met: 4 of 6
48. (drive-truck truck4 s0 s4 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   changed: (fuel-used) from 12871 to 13791
   goals met: 3 of 6
49. (drive-truck truck4 s4 s9 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s9)
   changed: (fuel-used) from 13791 to 14671
   goals met: 3 of 6
50. (walk driver1 p6-4 s4)
   deleted: (at driver1 p6-4)
   added: (at driver1 s4)
   goals met: 3 of 6
51. (drive-truck truck4 s9 s4 driver3)
   deleted: (at truck4 s9)
   added: (at truck4 s4)
   changed: (fuel-used) from 14671 to 15551
   goals met: 3 of 6
52. (disembark-truck driver3 truck4 s4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s4) (empty truck4)
   goals met: 3 of 6
53. (board-truck driver3 truck3 s4)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 6
54. (drive-truck truck3 s4 s3 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (fuel-used) from 15551 to 15561
   goals met: 4 of 6
55. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 4 of 6
56. (walk driver3 s3 p4-3)
   deleted: (at driver3 s3)
   added: (at driver3 p4-3)
   goals met: 4 of 6
57. (walk driver1 s4 p10-4)
   deleted: (at driver1 s4)
   added: (at driver1 p10-4)
   goals met: 4 of 6
58. (walk driver1 p10-4 s10)
   deleted: (at driver1 p10-4)
   added: (at driver1 s10)
   goals met: 4 of 6
59. (walk driver3 p4-3 s4)
   deleted: (at driver3 p4-3)
   added: (at driver3 s4)
   goals met: 4 of 6
60. (board-truck driver3 truck4 s4)
   deleted: (at driver3 s4) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 4 of 6
61. (drive-truck truck4 s4 s0 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (fuel-used) from 15561 to 16481
   goals met: 5 of 6
62. (walk driver1 s10 p10-7)
   deleted: (at driver1 s10)
   added: (at driver1 p10-7)
   goals met: 5 of 6
63. (walk driver1 p10-7 s7)
   deleted: (at driver1 p10-7)
   added: (at driver1 s7)
   goals met: 5 of 6
64. (board-truck driver1 truck2 s7)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 5 of 6
65. (drive-truck truck2 s7 s5 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   changed: (fuel-used) from 16481 to 16671
   goals met: 6 of 6
